In [1]:
#Importation des librairy pandas et numpy
import pandas as pd
import numpy as np

In [2]:
#Chemin absolu vers le dossier de traitement de fichier

In [3]:
cd F:\\My_Everything\\Documents\\Mon_Dossier_stage_HB_14_01_20\\DCDJ

F:\My_Everything\Documents\Mon_Dossier_stage_HB_14_01_20\DCDJ

In [4]:
# Chargement des fichiers
Feuille1 = 'A.xlsx'
Feuille2 = 'B.xlsx'
Resultat_traitement = 'C.xlsx'
df_1 = pd.read_excel(Feuille1)
df_2 = pd.read_excel(Feuille2)

In [5]:
df_1.head()

                 Code   TelPers
0   0064/AN/08/07134E       NaN
1    SOGB/01/07/00007  09997848
2    0747/AV/14/00045  45110655
3    0677/DA/11/00110       NaN
4    0584/02/10/00011       NaN

In [6]:
df_2.head()

               Code                        NomPre
0               NaN             BOUGOUMA N'DIAYE
1  SOGB/01/07/00007            MADINGAR CATHERINE
2  0747/AV/14/00045                  DIARRA OUMOU
3  0677/DA/11/00110  KOUASSI PIERRE EDWIGE ADJOUA
4  0584/02/10/00011             KAMGOUTE DIATOUBA

In [7]:
# Affichons les columns des fichiers pour retrouver la clé de jointure. Ici c'est Code
print(df_1.columns, df_2.columns)

Index(['Code', 'TelPers'], dtype='object') Index(['Code', 'NomPre'], dtype='object')

In [8]:
#Effectuons la jointure entre les 2 fichiers sur Code qui se trouve à gauche
df_3 = pd.merge(df_1, df_2, on='Code', how='left')

In [9]:
df_3.head()

                 Code   TelPers                        NomPre
0   0064/AN/08/07134E       NaN                           NaN
1    SOGB/01/07/00007  09997848            MADINGAR CATHERINE
2    0747/AV/14/00045  45110655                  DIARRA OUMOU
3    0677/DA/11/00110       NaN  KOUASSI PIERRE EDWIGE ADJOUA
4    0584/02/10/00011       NaN             KAMGOUTE DIATOUBA

In [10]:
#Remplaçons les NaN par du vide (les parties oû la jointure ne correspond pas)
df_3.replace(np.NaN, '', regex=True)
df_3.head()

                 Code   TelPers                        NomPre
0   0064/AN/08/07134E       NaN                           NaN
1    SOGB/01/07/00007  09997848            MADINGAR CATHERINE
2    0747/AV/14/00045  45110655                  DIARRA OUMOU
3    0677/DA/11/00110       NaN  KOUASSI PIERRE EDWIGE ADJOUA
4    0584/02/10/00011       NaN             KAMGOUTE DIATOUBA

In [11]:
#Sauvegardons le resultat dans un fichier Excel
df_3.to_excel(Resultat_traitement)